name: "cnn_model"
platform: "onnxruntime_onnx"
max_batch_size: 16

input [
  {
    name: "input"
    data_type: TYPE_FP32
    format: FORMAT_NCHW
    dims: [3, 128, 128]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [1]
  }
]
  dynamic_batching {}